GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_system.c
/*
 * Copyright (c) 2017-2020 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv6m.h"
#include "stm32l0_gpio.h"
#include "stm32l0_exti.h"
#include "stm32l0_rtc.h"
#include "stm32l0_eeprom.h"
#include "stm32l0_system.h"

#undef abs
#define abs(_i)  (((_i) >= 0) ? (_i) : -(_i))

uint32_t SystemCoreClock = 16000000;

typedef struct _stm32l0_system_device_t {
    uint16_t                  reset;
    uint16_t                  wakeup;
    uint32_t                  lseclk;
    uint32_t                  hseclk;
    uint32_t                  lsiclk;
    uint32_t                  sysclk;
    uint32_t                  hclk;
    uint32_t                  pclk1;
    uint32_t                  pclk2;
    uint8_t                   lsi;
    uint8_t                   hsi16;
    uint8_t                   hsi48;
    uint8_t                   mco;
    volatile uint8_t          event;
    volatile uint8_t          lock[STM32L0_SYSTEM_LOCK_COUNT];
    volatile uint32_t         reference;
    stm32l0_system_notify_t   *notify;
    stm32l0_rtc_timer_t       timeout;
} stm32l0_system_device_t;

static stm32l0_system_device_t stm32l0_system_device;

static volatile uint32_t * const stm32l0_system_xlate_RSTR[STM32L0_SYSTEM_PERIPH_COUNT] = {
    &RCC->APB2RSTR,            /* STM32L0_SYSTEM_PERIPH_ADC */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_DAC */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_USB */
    &RCC->APB2RSTR,            /* STM32L0_SYSTEM_PERIPH_USART1 */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_USART2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_USART4 */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_USART5 */
#endif /* STM32L072xx || STM32L082xx */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_LPUART1 */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_I2C1 */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_I2C2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_I2C3 */
#endif /* STM32L072xx || STM32L082xx */
    &RCC->APB2RSTR,            /* STM32L0_SYSTEM_PERIPH_SPI1 */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_SPI2 */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_TIM2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_TIM3 */
#endif /* STM32L072xx || STM32L082xx */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_TIM6 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_TIM7 */
#endif /* STM32L072xx || STM32L082xx */
    &RCC->APB2RSTR,            /* STM32L0_SYSTEM_PERIPH_TIM21 */
    &RCC->APB2RSTR,            /* STM32L0_SYSTEM_PERIPH_TIM22 */
    &RCC->APB1RSTR,            /* STM32L0_SYSTEM_PERIPH_LPTIM1 */
    &RCC->AHBRSTR,             /* STM32L0_SYSTEM_PERIPH_CRC */
    &RCC->AHBRSTR,             /* STM32L0_SYSTEM_PERIPH_RNG */
};

static uint32_t const stm32l0_system_xlate_RSTMSK[STM32L0_SYSTEM_PERIPH_COUNT] = {
    RCC_APB2RSTR_ADCRST,       /* STM32L0_SYSTEM_PERIPH_ADC */
    RCC_APB1RSTR_DACRST,       /* STM32L0_SYSTEM_PERIPH_DAC */
    RCC_APB1RSTR_USBRST,       /* STM32L0_SYSTEM_PERIPH_USB */
    RCC_APB2RSTR_USART1RST,    /* STM32L0_SYSTEM_PERIPH_USART1 */
    RCC_APB1RSTR_USART2RST,    /* STM32L0_SYSTEM_PERIPH_USART2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    RCC_APB1RSTR_USART4RST,    /* STM32L0_SYSTEM_PERIPH_USART4 */
    RCC_APB1RSTR_USART5RST,    /* STM32L0_SYSTEM_PERIPH_USART5 */
#endif /* STM32L072xx || STM32L082xx */
    RCC_APB1RSTR_LPUART1RST,   /* STM32L0_SYSTEM_PERIPH_LPUART1 */
    RCC_APB1RSTR_I2C1RST,      /* STM32L0_SYSTEM_PERIPH_I2C1 */
    RCC_APB1RSTR_I2C2RST,      /* STM32L0_SYSTEM_PERIPH_I2C2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    RCC_APB1RSTR_I2C3RST,      /* STM32L0_SYSTEM_PERIPH_I2C3 */
#endif /* STM32L072xx || STM32L082xx */
    RCC_APB2RSTR_SPI1RST,      /* STM32L0_SYSTEM_PERIPH_SPI1 */
    RCC_APB1RSTR_SPI2RST,      /* STM32L0_SYSTEM_PERIPH_SPI2 */
    RCC_APB1RSTR_TIM2RST,      /* STM32L0_SYSTEM_PERIPH_TIM2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    RCC_APB1RSTR_TIM3RST,      /* STM32L0_SYSTEM_PERIPH_TIM3 */
#endif /* STM32L072xx || STM32L082xx */
    RCC_APB1RSTR_TIM6RST,      /* STM32L0_SYSTEM_PERIPH_TIM6 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    RCC_APB1RSTR_TIM7RST,      /* STM32L0_SYSTEM_PERIPH_TIM7 */
#endif /* STM32L072xx || STM32L082xx */
    RCC_APB2RSTR_TIM21RST,     /* STM32L0_SYSTEM_PERIPH_TIM21 */
    RCC_APB2RSTR_TIM22RST,     /* STM32L0_SYSTEM_PERIPH_TIM22 */
    RCC_APB1RSTR_LPTIM1RST,    /* STM32L0_SYSTEM_PERIPH_LPTIM1 */
    RCC_AHBRSTR_CRCRST,        /* STM32L0_SYSTEM_PERIPH_CRC */
    RCC_AHBRSTR_RNGRST,        /* STM32L0_SYSTEM_PERIPH_RNG */
};

static volatile uint32_t * const stm32l0_system_xlate_ENR[STM32L0_SYSTEM_PERIPH_COUNT] = {
    &RCC->APB2ENR,             /* STM32L0_SYSTEM_PERIPH_ADC */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_DAC */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_USB */
    &RCC->APB2ENR,             /* STM32L0_SYSTEM_PERIPH_USART1 */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_USART2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_USART4 */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_USART5 */
#endif /* STM32L072xx || STM32L082xx */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_LPUART1 */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_I2C1 */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_I2C2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_I2C3 */
#endif /* STM32L072xx || STM32L082xx */
    &RCC->APB2ENR,             /* STM32L0_SYSTEM_PERIPH_SPI1 */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_SPI2 */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_TIM2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_TIM3 */
#endif /* STM32L072xx || STM32L082xx */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_TIM6 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_TIM7 */
#endif /* STM32L072xx || STM32L082xx */
    &RCC->APB2ENR,             /* STM32L0_SYSTEM_PERIPH_TIM21 */
    &RCC->APB2ENR,             /* STM32L0_SYSTEM_PERIPH_TIM22 */
    &RCC->APB1ENR,             /* STM32L0_SYSTEM_PERIPH_LPTIM1 */
    &RCC->AHBENR,              /* STM32L0_SYSTEM_PERIPH_CRC */
    &RCC->AHBENR,              /* STM32L0_SYSTEM_PERIPH_RNG */
};

static uint32_t const stm32l0_system_xlate_ENMSK[STM32L0_SYSTEM_PERIPH_COUNT] = {
    RCC_APB2ENR_ADCEN,         /* STM32L0_SYSTEM_PERIPH_ADC */
    RCC_APB1ENR_DACEN,         /* STM32L0_SYSTEM_PERIPH_DAC */
    RCC_APB1ENR_USBEN,         /* STM32L0_SYSTEM_PERIPH_USB */
    RCC_APB2ENR_USART1EN,      /* STM32L0_SYSTEM_PERIPH_USART1 */
    RCC_APB1ENR_USART2EN,      /* STM32L0_SYSTEM_PERIPH_USART2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    RCC_APB1ENR_USART4EN,      /* STM32L0_SYSTEM_PERIPH_USART4 */
    RCC_APB1ENR_USART5EN,      /* STM32L0_SYSTEM_PERIPH_USART5 */
#endif /* STM32L072xx || STM32L082xx */
    RCC_APB1ENR_LPUART1EN,     /* STM32L0_SYSTEM_PERIPH_LPUART1 */
    RCC_APB1ENR_I2C1EN,        /* STM32L0_SYSTEM_PERIPH_I2C1 */
    RCC_APB1ENR_I2C2EN,        /* STM32L0_SYSTEM_PERIPH_I2C2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    RCC_APB1ENR_I2C3EN,        /* STM32L0_SYSTEM_PERIPH_I2C3 */
#endif /* STM32L072xx || STM32L082xx */
    RCC_APB2ENR_SPI1EN,        /* STM32L0_SYSTEM_PERIPH_SPI1 */
    RCC_APB1ENR_SPI2EN,        /* STM32L0_SYSTEM_PERIPH_SPI2 */
    RCC_APB1ENR_TIM2EN,        /* STM32L0_SYSTEM_PERIPH_TIM2 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    RCC_APB1ENR_TIM3EN,        /* STM32L0_SYSTEM_PERIPH_TIM3 */
#endif /* STM32L072xx || STM32L082xx */
    RCC_APB1ENR_TIM6EN,        /* STM32L0_SYSTEM_PERIPH_TIM6 */
#if defined(STM32L072xx) || defined(STM32L082xx)
    RCC_APB1ENR_TIM7EN,        /* STM32L0_SYSTEM_PERIPH_TIM7 */
#endif /* STM32L072xx || STM32L082xx */
    RCC_APB2ENR_TIM21EN,       /* STM32L0_SYSTEM_PERIPH_TIM21 */
    RCC_APB2ENR_TIM22EN,       /* STM32L0_SYSTEM_PERIPH_TIM22 */
    RCC_APB1ENR_LPTIM1EN,      /* STM32L0_SYSTEM_PERIPH_LPTIM1 */
    RCC_AHBENR_CRCEN,          /* STM32L0_SYSTEM_PERIPH_CRC */
    RCC_AHBENR_RNGEN,          /* STM32L0_SYSTEM_PERIPH_RNG */
};

void SystemInit(void)
{
    RCC->CIER = 0x00000000;

    RCC->APB1ENR |= RCC_APB1ENR_PWREN;

    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    /* Switch to Main Flash @ 0x00000000. Make sure all buffers are disabled.
     */

    FLASH->ACR = FLASH_ACR_DISAB_BUF;
        
    SYSCFG->CFGR1 &= ~SYSCFG_CFGR1_MEM_MODE;

    PWR->CR |= PWR_CR_DBP;
    
    while (!(PWR->CR & PWR_CR_DBP))
    {
    }

    /* Unlock RTC early.
     */
    RTC->WPR = 0xca;
    RTC->WPR = 0x53;

    /* If RTC_CR_BCK is set it means the reset was triggered to
     * branch throu to the STM32 BOOTLOADER.
     */
    if (RTC->CR & RTC_CR_BCK)
    {
        RTC->CR &= ~RTC_CR_BCK;
        RTC->WPR = 0x00;

