GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_system.c
        SYSCFG->CFGR1 |= SYSCFG_CFGR1_MEM_MODE_0;

        FLASH->ACR = 0;

        RCC->IOPENR |= (RCC_IOPENR_IOPAEN | RCC_IOPENR_IOPBEN | RCC_IOPENR_IOPCEN);

        GPIOA->LCKR = 0x0001e7ff;
        GPIOA->LCKR = 0x0000e7ff;
        GPIOA->LCKR = 0x0001e7ff;
        GPIOA->LCKR;
        GPIOB->LCKR = 0x0001ffff;
        GPIOB->LCKR = 0x0000ffff;
        GPIOB->LCKR = 0x0001ffff;
        GPIOB->LCKR;
        GPIOC->LCKR = 0x00011fff;
        GPIOC->LCKR = 0x00001fff;
        GPIOC->LCKR = 0x00011fff;
        GPIOC->LCKR;

        RCC->IOPENR &= ~(RCC_IOPENR_IOPAEN | RCC_IOPENR_IOPBEN | RCC_IOPENR_IOPCEN);

        RCC->APB2ENR &= ~RCC_APB2ENR_SYSCFGEN;

        RCC->APB1ENR &= ~RCC_APB1ENR_PWREN;
        
        /* This needs to be assembly code as GCC catches NULL 
         * dereferences ...
         */
        __asm__ volatile ("   ldr     r2, =0x00000000                \n"
                          "   ldr     r0, [r2, #0]                   \n"
                          "   ldr     r1, [r2, #4]                   \n"
                          "   msr     MSP, r0                        \n"
                          "   dsb                                    \n"
                          "   isb                                    \n"
                          "   bx      r1                             \n");
    }
    
    /* We should be at a 2MHz MSI clock, so switch to HSI16 for the
     * init code to be half way fast.
     */
    FLASH->ACR = FLASH_ACR_PRFTEN;

    RCC->CR |= RCC_CR_HSION;
        
    while (!(RCC->CR & RCC_CR_HSIRDY))
    {
    }

    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;

    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
    {
    }

    RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2)) | (RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV2 | RCC_CFGR_PPRE2_DIV2);
    __DSB();
    __NOP();
    __NOP();
    __NOP();

    RCC->APB1ENR &= ~RCC_APB1ENR_PWREN;

    SystemCoreClock = 16000000;
}

void stm32l0_system_initialize(uint32_t hclk, uint32_t pclk1, uint32_t pclk2, uint32_t lseclk, uint32_t hseclk, uint32_t option)
{
    uint32_t primask, n, count, hsiclk, hsitrim, clk, trim, tc0, tc1;

    primask = __get_PRIMASK();

    __disable_irq();

    RCC->APB1ENR |= RCC_APB1ENR_PWREN;

    if (PWR->CSR & PWR_CSR_SBF)
    {
        stm32l0_system_device.reset = STM32L0_SYSTEM_RESET_STANDBY;
        stm32l0_system_device.wakeup = STM32L0_SYSTEM_WAKEUP_NONE;
        
        if (PWR->CSR & PWR_CSR_WUF)
        {
            if (RTC->ISR & (RTC_ISR_ALRAF | RTC_ISR_ALRBF))
            {
                if (RTC->ISR & RTC_ISR_ALRAF)
                {
                    stm32l0_system_device.wakeup |= STM32L0_SYSTEM_WAKEUP_ALARM;
                }
                
                if (RTC->ISR & RTC_ISR_ALRBF)
                {
                    stm32l0_system_device.wakeup |= STM32L0_SYSTEM_WAKEUP_TIMEOUT;
                }
            }
            else
            {
                stm32l0_system_device.wakeup |= STM32L0_SYSTEM_WAKEUP_PIN;
            }

            PWR->CR |= PWR_CR_CSBF;
        }
        
        RTC->CR &= ~(RTC_CR_ALRBIE | RTC_CR_ALRAIE | RTC_CR_ALRBE | RTC_CR_ALRAE);
        RTC->ISR = ~(RTC_ISR_ALRBF | RTC_ISR_ALRAF | RTC_ISR_INIT);

        if (RCC->CSR & (RCC_CSR_IWDGRSTF | RCC_CSR_WWDGRSTF))
        {
            stm32l0_system_device.wakeup |= STM32L0_SYSTEM_WAKEUP_WATCHDOG;
        }
        
        if (RCC->CSR & (RCC_CSR_FWRSTF | RCC_CSR_SFTRSTF | RCC_CSR_LPWRRSTF | RCC_CSR_OBLRSTF | RCC_CSR_PINRSTF))
        {
            stm32l0_system_device.wakeup |= STM32L0_SYSTEM_WAKEUP_RESET;
        }
    }
    else
    {
        stm32l0_system_device.reset = STM32L0_SYSTEM_RESET_POWERON;
        stm32l0_system_device.wakeup = STM32L0_SYSTEM_WAKEUP_NONE;
        
        if (RCC->CSR & (RCC_CSR_IWDGRSTF | RCC_CSR_WWDGRSTF))
        {
            stm32l0_system_device.reset = STM32L0_SYSTEM_RESET_WATCHDOG;
        }
        
        else if (RCC->CSR & RCC_CSR_FWRSTF)
        {
            stm32l0_system_device.reset = STM32L0_SYSTEM_RESET_FIREWALL;
        }
        
        else if (RCC->CSR & RCC_CSR_SFTRSTF)
        {
            stm32l0_system_device.reset = STM32L0_SYSTEM_RESET_SOFTWARE;
        }
        
        else if (RCC->CSR & (RCC_CSR_LPWRRSTF | RCC_CSR_OBLRSTF))
        {
            stm32l0_system_device.reset = STM32L0_SYSTEM_RESET_INTERNAL;
        }
        
        else if (RCC->CSR & RCC_CSR_PINRSTF)
        {
            stm32l0_system_device.reset = STM32L0_SYSTEM_RESET_EXTERNAL;
        }
    }
    
    RCC->CSR |= RCC_CSR_RMVF;
    RCC->CSR &= ~RCC_CSR_RMVF;
    
    stm32l0_system_device.lseclk = lseclk;
    stm32l0_system_device.hseclk = hseclk;
    stm32l0_system_device.lsiclk = 37000;

    if (stm32l0_system_device.reset == STM32L0_SYSTEM_RESET_STANDBY)
    {
        /* Use saved initialization data from BKP4R when returning from STANDBY to avoid
         * calbibration.
         */

        if (!(RCC->CSR & RCC_CSR_LSEON))
        {
            stm32l0_system_device.lseclk = 0;

            stm32l0_system_device.lsi |= 0x80;
        }

        if (RTC->BKP4R & 0x00004000)
        {
            if (option & STM32L0_SYSTEM_OPTION_HSE_BYPASS)
            {
                RCC->CR |= RCC_CR_HSEBYP;
            }
        }
        else
        {
            stm32l0_system_device.hseclk = 0;
        }

        stm32l0_system_device.lsiclk = ((RTC->BKP4R & STM32L0_RTC_BKP4R_LSICLK_MASK) >> STM32L0_RTC_BKP4R_LSICLK_SHIFT) * STM32L0_RTC_BKP4R_LSICLK_SCALE;

        RCC->ICSCR = ((RCC->ICSCR & ~RCC_ICSCR_HSITRIM) | (((RTC->BKP4R & STM32L0_RTC_BKP4R_HSITRIM_MASK) >> STM32L0_RTC_BKP4R_HSITRIM_SHIFT) << RCC_ICSCR_HSITRIM_Pos));
    }
    else
    {
        if (lseclk)
        {
            if (option & STM32L0_SYSTEM_OPTION_LSE_BYPASS)
            {
                RCC->CSR |= RCC_CSR_LSEBYP;
            }

            RCC->CSR |= RCC_CSR_LSEON;
                
            /* The loop below take about 8 cycles per iteration. The startup time for
             * LSE is 5000ms. At 16MHz this corresponds to about 10000000 iterations.
             */
            count = 0;
            
            while (!(RCC->CSR & RCC_CSR_LSERDY))
            {
                if (++count >= 10000000)
                {
                    stm32l0_system_device.lseclk = 0;
                    
                    RCC->CSR &= ~RCC_CSR_LSEON;
                    break;
                }
            }
        }

        if (hseclk)
        {
            if (option & STM32L0_SYSTEM_OPTION_HSE_BYPASS)
            {
                RCC->CR |= RCC_CR_HSEBYP;
            }

            RCC->CR |= RCC_CR_HSEON;

            /* The loop below take about 8 cycles per iteration. The startup time for
             * HSE is 100ms. At 16MHz this corresponds to about 200000 iterations.
             */
            count = 0;
            
