GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_system.c
            while (!(RCC->CR & RCC_CR_HSERDY))
            {
                if (++count >= 200000)
                {
                    stm32l0_system_device.hseclk = 0;

                    RCC->CR &= ~RCC_CR_HSEBYP;
                    break;
                }
            }
            
            RCC->CR &= ~RCC_CR_HSEON;
        }

        RCC->CSR |= RCC_CSR_LSION;
        
        while (!(RCC->CSR & RCC_CSR_LSIRDY))
        {
        }

        if (stm32l0_system_device.lseclk)
        {
            /* Here HSI16 is the main clock, so count 32 pulses of LSE via TIM21.
             * This is 1/1024 of a second, so one can compute hsiclk from there.
             * Iterate over all hsitrim values to find the closest match.
             */

            hsiclk = 0;
            hsitrim = 0x10;

            RCC->APB2ENR |= RCC_APB2ENR_TIM21EN;

            TIM21->CR1   = TIM_CR1_URS;
            TIM21->CR2   = 0;
            TIM21->DIER  = 0;
            TIM21->PSC   = 0;
            TIM21->ARR   = 0xffff;
            TIM21->OR    = TIM21_OR_TI1_RMP_2; /* Select LSE as TI1 */
            TIM21->EGR   = TIM_EGR_UG;
            TIM21->CR1   |= TIM_CR1_CEN;

            TIM21->CCER  = 0;
            TIM21->CCMR1 = TIM_CCMR1_CC1S_0 | TIM_CCMR1_IC1PSC_1 | TIM_CCMR1_IC1PSC_0; /* Count every 8th pulse */
            TIM21->CCER  = TIM_CCER_CC1E;

            for (trim = 0; trim <= 0x1f; trim++)
            {
                RCC->ICSCR = (RCC->ICSCR & ~RCC_ICSCR_HSITRIM) | (trim << RCC_ICSCR_HSITRIM_Pos);

                TIM21->SR = 0;
        
                while (!(TIM21->SR & TIM_SR_CC1IF))
                {
                }
            
                tc0 = TIM21->CCR1;
        
                for (n = 0, count = 0; n < (32 / 8); n++)
                {
                    TIM21->SR = 0;
                
                    while (!(TIM21->SR & TIM_SR_CC1IF))
                    {
                    }
                
                    tc1 = TIM21->CCR1;
                
                    if (tc1 < tc0)
                    {
                        count += ((65536 + tc1) - tc0);
                    }
                    else
                    {
                        count += (tc1 - tc0);
                    }

                    tc0 = tc1;
                }

                clk = (32768 / 32) * count;

                if (abs((int)(16000000 - hsiclk)) > abs((int)(16000000 - clk)))
                {
                    hsiclk = clk;
                    hsitrim = trim;
                }
            }

            RCC->ICSCR = (RCC->ICSCR & ~RCC_ICSCR_HSITRIM) | (hsitrim << RCC_ICSCR_HSITRIM_Pos);

            /* Here HSI16 is the main clock, so count 256 pulses of LSI via TIM21.
             * By knowing hsiclk then lsiclk can be computed. lsiclk is needed for IWDG.
             */

            TIM21->CR1   &= ~TIM_CR1_CEN;
            TIM21->OR    = TIM21_OR_TI1_RMP_0 | TIM21_OR_TI1_RMP_2; /* Select LSI as TI1 */
            TIM21->EGR   = TIM_EGR_UG;
            TIM21->CR1   |= TIM_CR1_CEN;

            TIM21->CCER  = 0;
            TIM21->CCMR1 = TIM_CCMR1_CC1S_0 | TIM_CCMR1_IC1PSC_1 | TIM_CCMR1_IC1PSC_0; /* Count every 8th pulse */
            TIM21->CCER  = TIM_CCER_CC1E;

            TIM21->SR = 0;
        
            while (!(TIM21->SR & TIM_SR_CC1IF))
            {
            }
        
            tc0 = TIM21->CCR1;
        
            for (n = 0, count = 0; n < (64 / 8); n++)
            {
                TIM21->SR = 0;
            
                while (!(TIM21->SR & TIM_SR_CC1IF))
                {
                }
            
                tc1 = TIM21->CCR1;
            
                if (tc1 < tc0)
                {
                    count += ((65536 + tc1) - tc0);
                }
                else
                {
                    count += (tc1 - tc0);
                }

                tc0 = tc1;
            }

            stm32l0_system_device.lsiclk = (16000000 * 64) / count;
        
            TIM21->CCER  = 0;
            TIM21->CCMR1 = 0;
            TIM21->CR1   = 0;
            TIM21->EGR   = 0;
            TIM21->OR    = 0;
            TIM21->SR    = 0;

            RCC->CSR &= ~RCC_CSR_LSION;

            RCC->APB2ENR &= ~RCC_APB2ENR_TIM21EN;
        }
        else
        {
            stm32l0_system_device.lsi |= 0x80;
        }

        /* Save cablibration to BKP4R for reuse when returning from STANDBY.
         */

        RTC->BKP4R = ((RTC->BKP4R & ~(STM32L0_RTC_BKP4R_LSICLK_MASK | STM32L0_RTC_BKP4R_HSEON_MASK | STM32L0_RTC_BKP4R_HSITRIM_MASK)) |
                      (((stm32l0_system_device.lsiclk + (STM32L0_RTC_BKP4R_LSICLK_SCALE / 2)) / STM32L0_RTC_BKP4R_LSICLK_SCALE) << STM32L0_RTC_BKP4R_LSICLK_SHIFT) |
                      (stm32l0_system_device.hseclk ? STM32L0_RTC_BKP4R_HSEON : 0) |
                      (((RCC->ICSCR & RCC_ICSCR_HSITRIM) >> RCC_ICSCR_HSITRIM_Pos) << STM32L0_RTC_BKP4R_HSITRIM_SHIFT));
    }

    /* Setup some default sleep mode clock gating.
     */
    RCC->IOPSMENR = 0;

    RCC->AHBSMENR  &= ~(RCC_AHBSMENR_MIFSMEN |
                        RCC_AHBSMENR_SRAMSMEN);
    
    RCC->APB1SMENR &= ~(RCC_APB1SMENR_PWRSMEN);

    RCC->APB2SMENR &= ~(RCC_APB2SMENR_DBGSMEN | 
                        RCC_APB2SMENR_SYSCFGSMEN);

    /* Setup the independent clocks for the peripherals to HSI16, except
     * LUPART which is LSE. CLK48 is driven by HSI48 with CRS.
     */
    RCC->CCIPR = (RCC_CCIPR_LPTIM1SEL_0 | RCC_CCIPR_LPTIM1SEL_1 |   /* LSE   */
                  RCC_CCIPR_I2C1SEL_1 |                             /* HSI16 */
#if defined(STM32L072xx) || defined(STM32L082xx)
                  RCC_CCIPR_I2C3SEL_1 |                             /* HSI16 */
#endif /* STM32L072xx || STM32L082xx */
                  RCC_CCIPR_HSI48SEL);                              /* HSI48 */

    RCC->APB1ENR &= ~RCC_APB1ENR_PWREN;

    __stm32l0_gpio_initialize();
    __stm32l0_exti_initialize();
    __stm32l0_rtc_initialize();
    __stm32l0_eeprom_initialize();

