GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_system.c
    stm32l0_system_sysclk_configure(hclk, pclk1, pclk2);

    stm32l0_rtc_timer_create(&stm32l0_system_device.timeout, (stm32l0_rtc_timer_callback_t)stm32l0_system_wakeup, NULL);

    __set_PRIMASK(primask);
}

bool stm32l0_system_sysclk_configure(uint32_t hclk, uint32_t pclk1, uint32_t pclk2)
{
    uint32_t primask, sysclk, hpre, ppre1, ppre2, msirange, pllmul, plldiv;

    if (hclk < 8000000)
    {
        /* Range 3, use MSI */

        /* Reading RTC requires HCLK >= 7 * RTCCLK. Hence clocks
         * below 229kHz will not work, and hence LPRUN will not 
         * be usable.
         */
        
        if      (hclk >= 4000000) { sysclk = 4194304; msirange = RCC_ICSCR_MSIRANGE_6; }
        else if (hclk >= 2000000) { sysclk = 2097152; msirange = RCC_ICSCR_MSIRANGE_5; }
        else if (hclk >= 1000000) { sysclk = 1048576; msirange = RCC_ICSCR_MSIRANGE_4; }
        else if (hclk >=  500000) { sysclk =  524288; msirange = RCC_ICSCR_MSIRANGE_3; }
        else                      { sysclk =  262144; msirange = RCC_ICSCR_MSIRANGE_2; }

        hclk = sysclk;

        hpre   = RCC_CFGR_HPRE_DIV1;
        pllmul = 0;
        plldiv = 0;
    }
    else
    {
        if (hclk < 32000000)
        {
            /* Range 2, use HSI16 or PLL on HSE */
                
            sysclk   = 16000000;
            hclk     = sysclk;
                
            hpre     = RCC_CFGR_HPRE_DIV1;
            msirange = 0;

            if (stm32l0_system_device.hseclk == 8000000)
            {
                pllmul   = RCC_CFGR_PLLMUL6;
                plldiv   = RCC_CFGR_PLLDIV3;
            }
            else
            {
                pllmul   = RCC_CFGR_PLLMUL3;
                plldiv   = RCC_CFGR_PLLDIV3;
            }
        }
        else
        {
            /* Range 1, use PLL on HSI16 or HSE */
            
            sysclk   = 32000000;
            hclk     = sysclk;
            
            hpre     = RCC_CFGR_HPRE_DIV1;
            msirange = 0;
            
            if (stm32l0_system_device.hseclk == 8000000)
            {
                pllmul   = RCC_CFGR_PLLMUL12;
                plldiv   = RCC_CFGR_PLLDIV3;
            }
            else
            {
                pllmul   = RCC_CFGR_PLLMUL6;
                plldiv   = RCC_CFGR_PLLDIV3;
            }
        }
    }

    if (pclk1)
    {
        if      (pclk1 >= hclk      ) { pclk1 = hclk;      ppre1 = RCC_CFGR_PPRE1_DIV1;  }
        else if (pclk1 >= (hclk / 2)) { pclk1 = hclk /  2; ppre1 = RCC_CFGR_PPRE1_DIV2;  }
        else if (pclk1 >= (hclk / 4)) { pclk1 = hclk /  4; ppre1 = RCC_CFGR_PPRE1_DIV4;  }
        else if (pclk1 >= (hclk / 8)) { pclk1 = hclk /  8; ppre1 = RCC_CFGR_PPRE1_DIV8;  }
        else                          { pclk1 = hclk / 16; ppre1 = RCC_CFGR_PPRE1_DIV16; }
    }
    else
    {
        if (hclk <= 4200000)
        {
            pclk1 = hclk;

            ppre1 = RCC_CFGR_PPRE1_DIV1;
        }
        else
        {
            pclk1 = hclk / 2;

            ppre1 = RCC_CFGR_PPRE1_DIV2;
        }
    }

    if (pclk2)
    {
        if      (pclk2 >= hclk      ) { pclk2 = hclk;      ppre2 = RCC_CFGR_PPRE2_DIV1;  }
        else if (pclk2 >= (hclk / 2)) { pclk2 = hclk /  2; ppre2 = RCC_CFGR_PPRE2_DIV2;  }
        else if (pclk2 >= (hclk / 4)) { pclk2 = hclk /  4; ppre2 = RCC_CFGR_PPRE2_DIV4;  }
        else if (pclk2 >= (hclk / 8)) { pclk2 = hclk /  8; ppre2 = RCC_CFGR_PPRE2_DIV8;  }
        else                          { pclk2 = hclk / 16; ppre2 = RCC_CFGR_PPRE2_DIV16; }
    }
    else
    {
        if (hclk < 8000000)
        {
            pclk2 = hclk;

            ppre2 = RCC_CFGR_PPRE2_DIV1;
        }
        else
        {
            pclk2 = hclk / 2;

            ppre2 = RCC_CFGR_PPRE2_DIV2;
        }
    }

    primask = __get_PRIMASK();

    __disable_irq();

    if (stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_RUN] ||
        ((stm32l0_system_device.reference & STM32L0_SYSTEM_REFERENCE_USB)  && (pclk1  < 16000000)) ||
        ((stm32l0_system_device.reference & STM32L0_SYSTEM_REFERENCE_I2C1) && (sysclk < 32000000)) ||
        ((stm32l0_system_device.reference & STM32L0_SYSTEM_REFERENCE_I2C2) && (pclk1  <  4000000)) ||
        ((stm32l0_system_device.reference & STM32L0_SYSTEM_REFERENCE_I2C3) && (sysclk < 32000000)))
    {
        __set_PRIMASK(primask);
        
        return false;
    }

    armv6m_systick_disable();

    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    
    FLASH->ACR = FLASH_ACR_PRFTEN | FLASH_ACR_LATENCY;

    /* Switch to Range 1 */
    PWR->CR = (PWR->CR & ~PWR_CR_VOS) | PWR_CR_VOS_0;
        
    while (PWR->CSR & PWR_CSR_VOSF)
    {
    }

    /* Switch to HSI16 as system clock */
    RCC->CR |= RCC_CR_HSION;
        
    while (!(RCC->CR & RCC_CR_HSIRDY))
    {
    }

    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSI;

    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI)
    {
    }

    /* Turn MSI off so that the range can be switched */
    RCC->CR &= ~RCC_CR_MSION;

    /* Turn PLL off so that the range can be switched */
    RCC->CR &= ~RCC_CR_PLLON;
    
    while (RCC->CR & RCC_CR_PLLRDY)
    {
    }

    /* Turn off HSE */
    if (stm32l0_system_device.hseclk)
    {
        RCC->CR &= ~RCC_CR_HSEON;
    }

    RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2)) | (RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV2 | RCC_CFGR_PPRE2_DIV2);
    __DSB();
    __NOP();
    __NOP();
    __NOP();

    if (hclk < 8000000)
    {
        /* Range 3, use MSI */

        RCC->ICSCR = (RCC->ICSCR & ~RCC_ICSCR_MSIRANGE) | msirange;

        RCC->CR |= RCC_CR_MSION;
    
        while (!(RCC->CR & RCC_CR_MSIRDY))
        {
        }
        
        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_MSI;

        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_MSI)
        {
        }

        stm32l0_system_device.hsi16 &= ~0x80;

        RCC->CFGR &= ~RCC_CFGR_STOPWUCK;
    }
    else
    {
        if (stm32l0_system_device.hseclk == 8000000)
        {
            RCC->CR |= RCC_CR_HSEON;

