GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_system.c
            while (!(RCC->CR & RCC_CR_HSERDY))
            {
            }

            RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLMUL | RCC_CFGR_PLLDIV)) | (RCC_CFGR_PLLSRC_HSE | pllmul | plldiv);
                
            RCC->CR |= RCC_CR_PLLON;
            
            while (!(RCC->CR & RCC_CR_PLLRDY))
            {
            }
            
            RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
            
            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
            {
            }

            stm32l0_system_device.hsi16 &= ~0x80;
        }
        else
        {
            if (hclk < 32000000)
            {
                /* Range 2, use HSI16 directly */
            }
            else
            {
                /* Range 1, use PLL on HSI16 */
                
                RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLMUL | RCC_CFGR_PLLDIV)) | (RCC_CFGR_PLLSRC_HSI | pllmul | plldiv);
                
                RCC->CR |= RCC_CR_PLLON;
                
                while (!(RCC->CR & RCC_CR_PLLRDY))
                {
                }
                
                RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
                
                while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
                {
                }
            }
            
            stm32l0_system_device.hsi16 |= 0x80;
        }

        RCC->CFGR |= RCC_CFGR_STOPWUCK;
    }

    if (!stm32l0_system_device.hsi16)
    {
        RCC->CR &= ~RCC_CR_HSION;
    }

    if ((hclk < 8000000) && !stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_RANGE_3] && !stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_RANGE_2_3])
    {
        /* Switch to Range 3 */
        PWR->CR = (PWR->CR & ~PWR_CR_VOS) | PWR_CR_VOS_0 | PWR_CR_VOS_1;
        
        while (PWR->CSR & PWR_CSR_VOSF)
        {
        }

        FLASH->ACR &= ~FLASH_ACR_LATENCY;
    }
    else if ((hclk < 32000000) && !stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_RANGE_2_3])
    {
        /* Switch to Range 2 */
        PWR->CR = (PWR->CR & ~PWR_CR_VOS) | PWR_CR_VOS_1;
        
        while (PWR->CSR & PWR_CSR_VOSF)
        {
        }

        if (hclk <= 8000000)
        {
            FLASH->ACR &= ~FLASH_ACR_LATENCY;
        }
    }
    else
    {
        if (hclk <= 16000000)
        {
            FLASH->ACR &= ~FLASH_ACR_LATENCY;
        }
    }

    RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2)) | (hpre | ppre1 | ppre2);
    __DSB();
    __NOP();
    __NOP();
    __NOP();

    RCC->APB1ENR &= ~RCC_APB1ENR_PWREN;

    SystemCoreClock = hclk;
    
    stm32l0_system_device.sysclk = sysclk;
    stm32l0_system_device.hclk = hclk;
    stm32l0_system_device.pclk1 = pclk1;
    stm32l0_system_device.pclk2 = pclk2;

    armv6m_systick_enable();

    stm32l0_system_notify(STM32L0_SYSTEM_EVENT_CLOCKS);

    __set_PRIMASK(primask);

    return true;
}

void stm32l0_system_lsi_enable(void)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    stm32l0_system_device.lsi++;
    
    if (stm32l0_system_device.lsi == 1)
    {
        RCC->CSR |= RCC_CSR_LSION;

        __set_PRIMASK(primask);
        
        while (!(RCC->CSR & RCC_CSR_LSIRDY))
        {
        }
    }
    else
    {
        __set_PRIMASK(primask);
    }
}

void stm32l0_system_lsi_disable(void)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    stm32l0_system_device.lsi--;
    
    if (stm32l0_system_device.lsi == 0)
    {
        RCC->CSR &= ~RCC_CSR_LSION;
        
        __set_PRIMASK(primask);
        
        while (RCC->CSR & RCC_CSR_LSIRDY)
        {
        }
    }
    else
    {
        __set_PRIMASK(primask);
    }
}

void stm32l0_system_hsi16_enable(void)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    stm32l0_system_device.hsi16++;    

    if (stm32l0_system_device.hsi16 == 1)
    {
        RCC->CR |= RCC_CR_HSION;

        __set_PRIMASK(primask);
        
        while (!(RCC->CR & RCC_CR_HSIRDY))
        {
        }
    }
    else
    {
        __set_PRIMASK(primask);
    }
}

void stm32l0_system_hsi16_disable(void)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    stm32l0_system_device.hsi16--;
    
    if (stm32l0_system_device.hsi16 == 0)
    {
        RCC->CR &= ~RCC_CR_HSION;
    }

    __set_PRIMASK(primask);
}

void stm32l0_system_hsi48_enable()
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    stm32l0_system_device.hsi48++;
    
    if (stm32l0_system_device.hsi48 == 1)
    {
        SYSCFG->CFGR3 |= (SYSCFG_CFGR3_ENREF_HSI48 | SYSCFG_CFGR3_EN_VREFINT);

        while (!(SYSCFG->CFGR3 & SYSCFG_CFGR3_VREFINT_RDYF))
        {
        }

        RCC->CRRCR |= RCC_CRRCR_HSI48ON;

        while(!(RCC->CRRCR & RCC_CRRCR_HSI48RDY))
        {
        }

        /* Enable CRS on HSI48 */
        RCC->APB1ENR |= RCC_APB1ENR_CRSEN;
        RCC->APB1ENR;

        /* 32768Hz * 1465 = 48005120Hz, Sync Source is LSE */
        CRS->CFGR = ((1465 -1) << CRS_CFGR_RELOAD_Pos) | (1 << CRS_CFGR_FELIM_Pos) | CRS_CFGR_SYNCSRC_0;
        CRS->CR |= (CRS_CR_AUTOTRIMEN | CRS_CR_CEN);
        
        stm32l0_system_lock(STM32L0_SYSTEM_LOCK_VREFINT);
    }

    __set_PRIMASK(primask);
}

void stm32l0_system_hsi48_disable(void)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    stm32l0_system_device.hsi48--;
    
    if (stm32l0_system_device.hsi48 == 0)
    {
        stm32l0_system_unlock(STM32L0_SYSTEM_LOCK_VREFINT);

        /* Disable CRS on HSI48 */
        CRS->CR &= ~(CRS_CR_AUTOTRIMEN | CRS_CR_CEN);
            
        RCC->APB1ENR &= ~RCC_APB1ENR_CRSEN;

        RCC->CRRCR &= ~RCC_CRRCR_HSI48ON;

        SYSCFG->CFGR3 &= ~SYSCFG_CFGR3_ENREF_HSI48;
    }

    __set_PRIMASK(primask);
}

void stm32l0_system_mco_configure(unsigned int mode, unsigned int divider)
{
    uint32_t mcopre;

    armv6m_atomic_and(&RCC->CFGR, ~(RCC_CFGR_MCOSEL | RCC_CFGR_MCOPRE));

