GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_system.c
    switch (stm32l0_system_device.mco) {
    case STM32L0_SYSTEM_MCO_MODE_NONE:
    case STM32L0_SYSTEM_MCO_MODE_SYSCLK:
    case STM32L0_SYSTEM_MCO_MODE_MSI:
    case STM32L0_SYSTEM_MCO_MODE_HSE:
    case STM32L0_SYSTEM_MCO_MODE_PLL:
    case STM32L0_SYSTEM_MCO_MODE_LSE:
        break;
      
    case STM32L0_SYSTEM_MCO_MODE_LSI:
        stm32l0_system_lsi_disable();
        break;
        
    case STM32L0_SYSTEM_MCO_MODE_HSI16:
        stm32l0_system_hsi16_disable();
        break;
        
    case STM32L0_SYSTEM_MCO_MODE_HSI48:
        stm32l0_system_hsi48_disable();
        break;
    }
    
    stm32l0_system_device.mco = mode;
    
    switch (stm32l0_system_device.mco) {
    case STM32L0_SYSTEM_MCO_MODE_NONE:
    case STM32L0_SYSTEM_MCO_MODE_SYSCLK:
    case STM32L0_SYSTEM_MCO_MODE_MSI:
    case STM32L0_SYSTEM_MCO_MODE_HSE:
    case STM32L0_SYSTEM_MCO_MODE_PLL:
    case STM32L0_SYSTEM_MCO_MODE_LSE:
        break;
        
    case STM32L0_SYSTEM_MCO_MODE_LSI:
        stm32l0_system_lsi_enable();
        break;
        
    case STM32L0_SYSTEM_MCO_MODE_HSI16:
        stm32l0_system_hsi16_enable();
        break;
        
    case STM32L0_SYSTEM_MCO_MODE_HSI48:
        stm32l0_system_hsi48_enable();
        break;
    }

    if      (divider <=  1) { mcopre = RCC_CFGR_MCOPRE_DIV1;  }
    else if (divider <=  2) { mcopre = RCC_CFGR_MCOPRE_DIV2;  }
    else if (divider <=  4) { mcopre = RCC_CFGR_MCOPRE_DIV4;  }
    else if (divider <=  8) { mcopre = RCC_CFGR_MCOPRE_DIV8;  }
    else                    { mcopre = RCC_CFGR_MCOPRE_DIV16; }
    
    armv6m_atomic_or(&RCC->CFGR, ((mode << RCC_CFGR_MCOSEL_Pos) | mcopre));
}

uint32_t stm32l0_system_reset_cause(void)
{
    return stm32l0_system_device.reset;
}

uint32_t stm32l0_system_wakeup_reason(void)
{
    return stm32l0_system_device.wakeup;
}

uint32_t stm32l0_system_lseclk(void)
{
    return stm32l0_system_device.lseclk;
}

uint32_t stm32l0_system_hseclk(void)
{
    return stm32l0_system_device.hseclk;
}

uint32_t stm32l0_system_lsiclk(void)
{
    return stm32l0_system_device.lsiclk;
}

uint32_t stm32l0_system_sysclk(void)
{
    return stm32l0_system_device.sysclk;
}

uint32_t stm32l0_system_hclk(void)
{
    return stm32l0_system_device.hclk;
}

uint32_t stm32l0_system_pclk1(void)
{
    return stm32l0_system_device.pclk1;
}

uint32_t stm32l0_system_pclk2(void)
{
    return stm32l0_system_device.pclk2;
}

void stm32l0_system_uid(uint32_t *uid)
{
    uid[0] = *((const uint32_t*)(UID_BASE + 0x00));
    uid[1] = *((const uint32_t*)(UID_BASE + 0x04));
    uid[2] = *((const uint32_t*)(UID_BASE + 0x14));
}

void stm32l0_system_periph_reset(unsigned int periph)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    *stm32l0_system_xlate_RSTR[periph] |= stm32l0_system_xlate_RSTMSK[periph];
    *stm32l0_system_xlate_RSTR[periph] &= ~stm32l0_system_xlate_RSTMSK[periph];

    __set_PRIMASK(primask);
}

void stm32l0_system_periph_enable(unsigned int periph)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    *stm32l0_system_xlate_ENR[periph] |= stm32l0_system_xlate_ENMSK[periph];
    *stm32l0_system_xlate_ENR[periph];

    __set_PRIMASK(primask);
}

void stm32l0_system_periph_disable(unsigned int periph)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    *stm32l0_system_xlate_ENR[periph] &= ~stm32l0_system_xlate_ENMSK[periph];

    __set_PRIMASK(primask);
}

void stm32l0_system_swd_enable(void)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    RCC->APB2ENR |= RCC_APB2ENR_DBGEN;
    RCC->APB2ENR;

    DBGMCU->CR = (DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY);
    DBGMCU->APB1FZ = (DBGMCU_APB1_FZ_DBG_RTC_STOP | DBGMCU_APB1_FZ_DBG_IWDG_STOP | DBGMCU_APB1_FZ_DBG_LPTIMER_STOP);
    DBGMCU->APB2FZ = 0;

    stm32l0_gpio_swd_enable();

    __set_PRIMASK(primask);
}

void stm32l0_system_swd_disable(void)
{
    uint32_t primask;

    primask = __get_PRIMASK();

    __disable_irq();

    stm32l0_gpio_swd_disable();

    RCC->APB2ENR |= RCC_APB2ENR_DBGEN;
    RCC->APB2ENR;

    DBGMCU->CR = 0;
    DBGMCU->APB1FZ = 0;
    DBGMCU->APB2FZ = 0;

    RCC->APB2ENR &= ~RCC_APB2ENR_DBGEN;

    __set_PRIMASK(primask);
}
void stm32l0_system_register(stm32l0_system_notify_t *notify, stm32l0_system_callback_t callback, void *context, uint32_t events)
{
    stm32l0_system_notify_t **pp_entry, *entry;

    for (pp_entry = &stm32l0_system_device.notify, entry = *pp_entry; entry; pp_entry = &entry->next, entry = *pp_entry)
    {
    }

    *pp_entry = notify;

    notify->next = NULL;
    notify->callback = callback;
    notify->context = context;
    notify->events = events;
}

void stm32l0_system_unregister(stm32l0_system_notify_t *notify)
{
    stm32l0_system_notify_t **pp_entry, *entry;

    notify->events = 0;
    notify->callback = NULL;

    for (pp_entry = &stm32l0_system_device.notify, entry = *pp_entry; entry; pp_entry = &entry->next, entry = *pp_entry)
    {
        if (entry == notify)
        {
            *pp_entry = notify->next;
            
            notify->next = NULL;

            break;
        }
    }
}

void stm32l0_system_notify(uint32_t events)
{
    stm32l0_system_notify_t *entry;

    for (entry = stm32l0_system_device.notify; entry; entry = entry->next)
    {
        if (entry->events & events)
        {
            (*entry->callback)(entry->context, entry->events & events);
        }
    }
}

void stm32l0_system_lock(uint32_t lock)
{
    __armv6m_atomic_incb(&stm32l0_system_device.lock[lock]);
}

void stm32l0_system_unlock(uint32_t lock)
{
    __armv6m_atomic_decb(&stm32l0_system_device.lock[lock]);
}

void stm32l0_system_reference(uint32_t reference)
{
    __armv6m_atomic_or(&stm32l0_system_device.reference, reference);
}

void stm32l0_system_unreference(uint32_t reference)
{
    __armv6m_atomic_and(&stm32l0_system_device.reference, ~reference);
}

void stm32l0_system_sleep(uint32_t policy, uint32_t timeout)
{
    uint32_t primask;
    stm32l0_gpio_stop_state_t gpio_stop_state;

    if (timeout != STM32L0_SYSTEM_TIMEOUT_NONE)
    {
        if (!stm32l0_system_device.event)
        {
            if (timeout != STM32L0_SYSTEM_TIMEOUT_FOREVER)
            {
                stm32l0_rtc_timer_start(&stm32l0_system_device.timeout, stm32l0_rtc_millis_to_clock(timeout), STM32L0_RTC_TIMER_MODE_RELATIVE);
            }

