GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_system.c
            if (!stm32l0_system_device.event)
            {
                if (policy >= STM32L0_SYSTEM_POLICY_SLEEP)
                {
                    stm32l0_system_notify(STM32L0_SYSTEM_EVENT_SLEEP);
                }

                while (!stm32l0_system_device.event)
                {
                    if ((policy <= STM32L0_SYSTEM_POLICY_RUN) || stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_RUN])
                    {
                        __WFE();
                        __NOP();
                        __NOP();
                        __NOP();
                        __NOP();
                    }
                    else
                    {
                        primask = __get_PRIMASK();

                        __disable_irq();

                        if (!stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_RUN])
                        {
                            if ((policy <= STM32L0_SYSTEM_POLICY_SLEEP) || stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_SLEEP])
                            {
                                /* ### add to downclock AHB/APB 
                                 */
                                __WFI();
                                __NOP();
                                __NOP();
                                __NOP();
                                __NOP();
                            }
                            else
                            {
                                if (!(SCB->ICSR & SCB_ICSR_ISRPENDING_Msk))
                                {
                                    stm32l0_system_notify(STM32L0_SYSTEM_EVENT_STOP_ENTER);

                                    if (!(SCB->ICSR & SCB_ICSR_ISRPENDING_Msk))
                                    {
                                        __stm32l0_exti_stop_enter();
                                        __stm32l0_gpio_stop_enter(&gpio_stop_state);

                                        if (!(SCB->ICSR & SCB_ICSR_ISRPENDING_Msk))
                                        {
                                            RCC->APB1ENR |= RCC_APB1ENR_PWREN;

                                            if (stm32l0_system_device.hsi48)
                                            {
                                                CRS->CR &= ~(CRS_CR_AUTOTRIMEN | CRS_CR_CEN);

                                                RCC->CRRCR &= ~RCC_CRRCR_HSI48ON;
                                            }

                                            /* The lowpower voltage regulator adds 3.3uS wakeup time, plus it prevents HSIKERON, 
                                             * which may be needed by USART1/USART2/LPUART to wakeup. In those cases do not
                                             * enable the low power voltage regulator in stop mode.
                                             */
                                            if (!stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_REGULATOR])
                                            {
                                                PWR->CR |= PWR_CR_LPSDSR;
                                            }
                    
                                            if (!stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_VREFINT])
                                            {
                                                /* Set ULP to disable VREFINT */
                                                SYSCFG->CFGR3 &= ~SYSCFG_CFGR3_EN_VREFINT;
                        
                                                PWR->CR |= (PWR_CR_FWU | PWR_CR_ULP);
                                            }

                                            /* Clear WUF flag */
                                            PWR->CR |= PWR_CR_CWUF;
                    
                                            /* Select STOP */
                                            PWR->CR &= ~PWR_CR_PDDS;

                                            if (!(SCB->ICSR & SCB_ICSR_ISRPENDING_Msk))
                                            {
                                                SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

                                                if (RCC->APB2ENR & RCC_APB2ENR_DBGEN)
                                                {
                                                    __WFI();
                                                    __NOP();
                                                    __NOP();
                                                    __NOP();
                                                    __NOP();
                                                }
                                                else
                                                {
                                                    FLASH->ACR |= FLASH_ACR_SLEEP_PD;
                        
                                                    __WFI();
                                                    __NOP();
                                                    __NOP();
                                                    __NOP();
                                                    __NOP();
                        
                                                    FLASH->ACR &= ~FLASH_ACR_SLEEP_PD;
                                                }

                                                SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
                                                
                                                /* Clear ULP to enable VREFINT, disable lowpower voltage regulator */
                                                PWR->CR &= ~(PWR_CR_FWU | PWR_CR_ULP | PWR_CR_LPSDSR);

                                                if (stm32l0_system_device.hclk <= 4200000)
                                                {
                                                    /* Range 3, MSI is wakeup clock */
                        
                                                    if (stm32l0_system_device.hsi16)
                                                    {
                                                        RCC->CR |= RCC_CR_HSION;
                            
                                                        while (!(RCC->CR & RCC_CR_HSIRDY))
                                                        {
                                                        }
                                                    }
                                                }
                                                else
                                                {
                                                    /* Range 1 & 2, HSI16 is wakeup clock */

                                                    if (stm32l0_system_device.hseclk == 8000000)
                                                    {
                                                        RCC->CR |= RCC_CR_HSEON;
                            
