GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_system.c
                                                        while (!(RCC->CR & RCC_CR_HSERDY))
                                                        {
                                                        }
                            
                                                        RCC->CR |= RCC_CR_PLLON;
                            
                                                        while (!(RCC->CR & RCC_CR_PLLRDY))
                                                        {
                                                        }
                                                        
                                                        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
                            
                                                        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
                                                        {
                                                        }
                                                    }
                                                    else
                                                    {
                                                        if (stm32l0_system_device.hclk > 16000000)
                                                        {
                                                            RCC->CR |= RCC_CR_PLLON;
                                
                                                            while (!(RCC->CR & RCC_CR_PLLRDY))
                                                            {
                                                            }
                                
                                                            RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
                                
                                                            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
                                                            {
                                                            }
                                                        }
                                                    }
                                                }
                                                
                                                if (!stm32l0_system_device.hsi16)
                                                {
                                                    RCC->CR &= ~RCC_CR_HSION;
                                                }
                                            }
                                            else
                                            {
                                                /* Clear ULP to enable VREFINT, disable lowpower voltage regulator */
                                                PWR->CR &= ~(PWR_CR_FWU | PWR_CR_ULP | PWR_CR_LPSDSR);
                                            }
                                                    
                                            if (stm32l0_system_device.hsi48)
                                            {
                                                RCC->CRRCR |= RCC_CRRCR_HSI48ON;

                                                while(!(RCC->CRRCR & RCC_CRRCR_HSI48RDY))
                                                {
                                                }
                                                
                                                CRS->CR |= (CRS_CR_AUTOTRIMEN | CRS_CR_CEN);
                                            }
                                            
                                            RCC->APB1ENR &= ~RCC_APB1ENR_PWREN;
                                        }
                                        
                                        __stm32l0_gpio_stop_leave(&gpio_stop_state);
                                        __stm32l0_exti_stop_leave();
                                    }
                                    
                                    stm32l0_system_notify(STM32L0_SYSTEM_EVENT_STOP_LEAVE);
                                }
                            }
                        }
                        
                        __set_PRIMASK(primask);
                    }
                }
            }
            
            if (timeout != STM32L0_SYSTEM_TIMEOUT_FOREVER)
            {
                stm32l0_rtc_timer_stop(&stm32l0_system_device.timeout);
            }
        }
    }
    
    stm32l0_system_device.event = 0;
}

void stm32l0_system_wakeup(void)
{
    stm32l0_system_device.event = 1;
}

void stm32l0_system_standby(uint32_t control, uint32_t timeout)
{
    uint32_t primask;

    if (timeout == STM32L0_SYSTEM_TIMEOUT_NONE)
    {
        return;
    }
    
    primask = __get_PRIMASK();
    
    __disable_irq();
    
    if (stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_RUN] ||
        stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_SLEEP] ||
        stm32l0_system_device.lock[STM32L0_SYSTEM_LOCK_DEEPSLEEP])
    {
        __set_PRIMASK(primask);
                        
        return;
    }
    
    stm32l0_system_notify(STM32L0_SYSTEM_EVENT_STANDBY);

    stm32l0_rtc_standby(control, timeout);
    
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    
    if (control & STM32L0_SYSTEM_CONTROL_WKUP1_RISING)
    {
        PWR->CSR |= PWR_CSR_EWUP1;
    }
    
    if (control & STM32L0_SYSTEM_CONTROL_WKUP2_RISING)
    {
        PWR->CSR |= PWR_CSR_EWUP2;
    }

#if defined(STM32L072xx)
    if (control & STM32L0_SYSTEM_CONTROL_WKUP3_RISING)
    {
        PWR->CSR |= PWR_CSR_EWUP3;
    }
#endif /* STM32L072xx */
    
    /* Enable the low power voltage regulator */
    PWR->CR |= PWR_CR_LPSDSR;

    /* COMP cannot wake from STANDBY, so nuke VREFINT
     */
    SYSCFG->CFGR3 &= ~SYSCFG_CFGR3_EN_VREFINT;

    PWR->CR |= PWR_CR_ULP;
    
    /* Clear WUF flag */
    PWR->CR |= PWR_CR_CWUF;
    
    /* Select STANDBY */
    PWR->CR |= PWR_CR_PDDS;

    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    
    __DSB();
    __SEV();
    __WFE();
    
    while (1)
    {
        __WFE();
    }
}

void stm32l0_system_reset(void)
{
    __disable_irq();

    stm32l0_system_notify(STM32L0_SYSTEM_EVENT_RESET);

    stm32l0_rtc_reset();

    NVIC_SystemReset();
    
    while (1)
    {
    }
}

void stm32l0_system_dfu(void)
{
    __disable_irq();

    stm32l0_system_notify(STM32L0_SYSTEM_EVENT_DFU);

    /* Set the BCK bit to flag a reboot into the booloader */
    RTC->CR |= RTC_CR_BCK;

    stm32l0_rtc_reset();

    NVIC_SystemReset();
    
    while (1)
    {
    }
}

static void __empty() { }

void __stm32l0_eeprom_initialize(void) __attribute__ ((weak, alias("__empty")));
